Repository: yamato/perl6doc-jp
Catalog: tm/auto/S02-bits-20140914.tmx
Source language: en_us
Languages: ja

source: TITLE
ja: タイトル

source: Synopsis 2:
ja: 概要2：

source: Bits and Pieces
ja: 断片

source: AUTHORS
ja: 著者

source: VERSION
ja: バージョン

source: This document summarizes Apocalypse 2, which covers small-scale lexical items and typological issues.
ja: このドキュメントはApocalypse 2を要約する。そして、それは小規模の語彙項目とタイプの問題を取り上げる。

source: (These Synopses also contain updates to reflect the evolving design of Perl 6 over time, unlike the Apocalypses, which are frozen in time as &quot;historical documents&quot;.
ja: （また、これらのSynopsesは時間とともにPerl 6の進化しているデザインを反映するために最新版を含む。そして、Apocalypsesと違っている。そして、それは史科としてやがて凍結される。

source: These updates are not marked--if a Synopsis disagrees with its Apocalypse, assume the Synopsis is correct.)
ja: これらの最新版は記録されない－概要がそのApocalypseと一致しないならば、Synopsisが正しいと仮定しなさい。）

source: One-pass parsing
ja: ワンパス構文解析

source: To the extent allowed by sublanguages' parsers, Perl is parsed using a one-pass, predictive parser.
ja: 部分言語のパーサーによって許される範囲で、Perlはワンパス（予測型構文解析法）を使って解析される。

source: That is, lookahead of more than one &quot;longest token&quot; is discouraged.
ja: つまり、複数の「最も長いトークン」の先読みは、認められない。

source: The currently known exceptions to this are where the parser must:
ja: 構文解析器がそうしなければならない所で、これに対する現在既知の例外はそうである：

source: * Locate the end of interpolated expressions that begin with a sigil and might or might not end with brackets.
ja: * シギルから始めて、ブラケットで終わるかもしれないか、終わらないかもしれない差し込まれた表現の終了を見つけなさい。

source: * Recognize that a reduce operator is not really beginning a [...] composer.
ja: * 減少演算子が[...]コンポーザーを本当に開始していないことを認知しなさい。

source: One-pass parsing is fundamental to knowing exactly which language you are dealing with at any moment, which in turn is fundamental to allowing unambiguous language mutation in any desired direction.
ja: ワンパス構文解析はあなたがいつ何時対処しているかについて、正確にわかっていることの基本となる。そして、それはつぎには、何か望ましい方向で明白な言語変化を許すことの基本となる。

source: (Generic languages are allowed, but only if intended;
ja: （しかし、意図される場合だけ、一般的な言語は許される;

source: accidentally generic languages lead to loss of linguistic identity and integrity.
ja: 偶然に一般的な言語は、結果として言語アイデンティティと完全性の損失に導く。

source: This is the hard lesson of Perl 5's source filters and other multi-pass parsing mistakes.)
ja: これは難しいレッスンであるPerl 5が、ソースフィルタである、そして、他のマルチパス構文解析は誤認する。）

source: Lexical Conventions
ja: 語彙的な規則

source: Unicode Semantics
ja: ユニコード意味論

source: In the abstract, Perl is written in Unicode, and has consistent Unicode semantics regardless of the underlying text representations.
ja: 抽象的に、Perlにはユニコードに書かれて、根底にある文字列内部表現に関係なく一貫したユニコード意味論がある。

source: By default Perl presents Unicode in &quot;NFG&quot; formation, where each grapheme counts as one character.
ja: デフォルトで、Perlは「NFG」形成においてユニコードを示す、そこで、各々の書記素は1つの文字と見なされる。

source: A grapheme is what the novice user would think of as a character in their normal everyday life, including any diacritics.
ja: 書記素は、彼らの通常の日常生活（何か発音区別符号を含む）で文字のように、初心者が考えるものである。

source: Perl can count Unicode line and paragraph separators as line markers, but that behavior had better be configurable so that Perl's idea of line numbers matches what your editor thinks about Unicode lines.
ja: Perlはユニコード行とパラグラフセパレーターをラインマーカーとして計算に入れることができる、しかし、行番号についてのPerlの考えがあなたの編集者がユニコード行について考えるものにマッチするように、そのふるまいは可変だった方がよい。

source: Unicode horizontal whitespace is counted as whitespace, but it's better not to use thin spaces where they will make adjoining tokens look like a single token.
ja: 横空白文字がそうであるユニコードは空白文字と見なされた、しかし、それらが隣接しているトークンを単一トークンのように見えさせる薄いスペースを使わない方が良い。

source: On the other hand, Perl doesn't use indentation as syntax, so you are free to use any amount of whitespace anywhere that whitespace makes sense.
ja: 他方、Perlは構文としてインデントを使わないので、あなたはどんなに多くの空白文字でも空白文字が意味をなすどこでも使って結構である。

source: Comments always count as whitespace.
ja: コメントは、常に空白文字と見なされる。

source: Bracketing Characters
ja: 文字を括弧に入れること

source: For some syntactic purposes, Perl distinguishes bracketing characters from non-bracketing.
ja: 若干の構文法の目的のために、Perlは非夾叉法から文字を括弧に入れることを識別する。

source: Bracketing characters are defined as any Unicode characters with either bidirectional mirrorings or Ps/Pe/Pi/Pf properties.
ja: 括弧に入れている文字は、双方向性ミラーリングかPs/Pe/Pi/Pfプロパティによる何かユニコード文字と定義される。

source: In practice, though, you're safest using matching characters with Ps/Pe/Pi/Pf properties, though ASCII angle brackets are a notable exception, since they're bidirectional but not in the Ps/Pe/Pi/Pf sets.
ja: 実際には、しかし、それらが双方向性であるが、Ps/Pe/Pi/Pfセットでない時から、ASCIIかぎ括弧が顕著な例外であるけれども、あなたはマッチする文字を使用してPs/Pe/Pi/Pfプロパティにとって最も安全である。

source: Characters with no corresponding closing character do not qualify as opening brackets.
ja: 対応する終わりの文字のない文字は、左大括弧としての資格を得ない。

source: This includes the second section of the Unicode BidiMirroring data table.
ja: これは、ユニコードBidiMirroringデータテーブルの市場第二部を含む。

source: If a character is already used in Ps/Pe/Pi/Pf mappings, then any entry in BidiMirroring is ignored (both forward and backward mappings).
ja: 文字がPs/Pe/Pi/Pfマッピングですでに使われるならば、BidiMirroringの何かエントリーは無視される（両方のマスト傾斜角マッピング）。

source: For any given Ps character, the next Pe codepoint (in numerical order) is assumed to be its matching character even if that is not what you might guess using left-right symmetry.
ja: ピコセカンド文字を与えられる何のためにでも、たとえそれがあなたが左の右対称性を使って推測するかもしれないものでないとしても、次のペーコードポイント（番号順で）はそのマッチする文字であるとされる。

source: Therefore U+298D maps to U+298E, not U+2990, and U+298F maps to U+2990, not U+298E.
ja: したがって、U+298DはU+2990（U+298Eでない）に、U+298E、U+2990でないとU+298Fマップに写像する。

source: Neither U+298E nor U+2990 are valid bracket openers, despite having reverse mappings in the BidiMirroring table.
ja: BidiMirroringテーブルに逆のマッピングを持つことにもかかわらず、U+298EもU+2990も、有効なブラケットオープナーでない。

source: The U+301D codepoint has two closing alternatives, U+301E and U+301F;
ja: U+301Dコードポイントは、2つの終わりの選択肢、U+301EとU+301Fを持つ;

source: Perl 6 only recognizes the one with lower code point number, U+301E, as the closing brace.
ja: Perl 6は、低いコードポイント番号（U+301E）で、一方を右中括弧と認知するだけである。

source: This policy also applies to new one-to-many mappings introduced in the future.
ja: この方針も、将来持ち出される新しい１対多のマッピングにあてはまる。

source: However, many-to-one mappings are fine;
ja: しかし、多対1マッピングはすばらしい;

source: multiple opening characters may map to the same closing character.
ja: 文字が同じ終わりの文字にマップするかもしれない複数の開始。

source: For instance, U+2018, U+201A, and U+201B may all be used as the opener for the U+2019 closer.
ja: たとえば、U+2018、U+201AとU+201Bのすべてが、より近いU+2019のためのオープナーとして使われるかもしれない。

source: Constructs that count openers and closers assume that only the given opener is special.
ja: オープナーとクローザーを数える構成概念は、所定のオープナーだけが特別であると仮定する。

source: That is, if you open with one of the alternatives, all other alternatives are treated as non-bracketing characters within that construct.
ja: つまり、あなたが選択肢の1つで始めるならば、他の全ての選択肢はその構成概念の範囲内で文字を非括弧に入れることとみなされる。

source: Multiline Comments
ja: マルチラインコメント

source: Pod sections may be used reliably as multiline comments in Perl 6.
ja: ポッドセクションが、Perl 6のマルチラインコメントとして、信頼できるように使われるかもしれない。

source: Unlike in Perl 5, Pod syntax now lets you use =begin comment and =end comment delimit a Pod block correctly without the need for =cut.
ja: Perl 5のとは異なり、ポッド構文は現在あなたに=begin commentを使わせる、そして、=end commentは=cutの正しくポッドブロックを区切る。

source: (In fact, =cut is now gone.) The format name does not have to be comment -- any unrecognized format name will do to make it a comment.
ja: フォーマット名はcommentである必要はない（実際、=cutは現在なくなる。）－何か認められていないフォーマット名でもコメントにするために良い。

source: (However, bare =begin and =end probably aren't good enough, because all comments in them will show up in the formatted output.)
ja: （しかし、それらのすべてのコメントが書式付き出力で現れるので、裸の=beginと=endは多分十分によくないだろう。）

source: We have single paragraph comments with =for comment as well.
ja: 我々は、同様に=for commentで一回のパラグラフコメントをする。

source: That lets =for keep its meaning as the equivalent of a =begin and =end combined.
ja: =beginと=end相当が組み合わさったので、それは=forをその意味を保たせる。

source: As with =begin and =end, a comment started in code reverts to code afterwards.
ja: =beginと=endと同様に、暗号で始まるコメントは、その後コードに戻る。

source: Since there is a newline before the first =, the Pod form of comment counts as whitespace equivalent to a newline.
ja: 改行文字が最初の=の前にあるので、コメントのポッドの形態は改行文字への空白文字等価物と見なされる。

source: See S26 for more on embedded documentation.
ja: 埋め込みドキュメンテーションの詳細についてS26を見なさい。

source: Single-line Comments
ja: １行コメント

source: Except within a quote literal, a # character always introduces a comment in Perl 6.
ja: 文字通りの引用の範囲内であること以外は、#文字は常にPerl 6でコメントを始める。

source: There are two forms of comment based on #.
ja: #に基づくコメントの2つの形が、ある。

source: Embedded comments require the # to be followed by a backtick (`) plus one or more opening bracketing characters.
ja: 埋め込みコメントは、文字を括弧に入れているbacktick（`）プラス一つ以上の開始が続くことを#に要求する。

source: All other uses of # are interpreted as single-line comments that work just as in Perl 5, starting with a # character and ending at the subsequent newline.
ja: #の他の全ての使用はPerl 5の場合のようにちょうど機能する１行コメントと解釈される。そして、#文字から始めて、以降の改行文字のところで終わる。

source: They count as whitespace equivalent to newline for purposes of separation.
ja: それらは、分離のための改行文字への空白文字等価物と見なされる。

source: Unlike in Perl 5, # may not be used as the delimiter in quoting constructs.
ja: Perl 5のとは異なり、#が、構成物を引合いに出すことでのデリミタとして使われないかもしれない。

source: Embedded Comments
ja: 埋め込みコメント

source: Embedded comments are supported as a variant on quoting syntax, introduced by #` plus any user-selected bracket characters (as defined in &quot;Bracketing Characters&quot; above):
ja: 埋め込みコメントは構文を引合いに出すことの変形としてサポートされる。そして、#`さらに何かユーザーを選ばれたブラケット文字（上の文字を括弧に入れる際に定義されるように）によって始められる：

source: Brackets may be nested, following the same policy as ordinary quote brackets.
ja: 普通の引用が括弧に入れるのと同じ方針の後、ブラケットはネスト状である場合がある。

source: There must be no space between the #` and the opening bracket character.
ja: #`と左大括弧文字の間の隙間が、あってはならない。

source: (There may be the visual appearance of space for some double-wide characters, however, such as the corner quotes above.)
ja: （しかし、若干の2倍幅文字のためのスペース（例えば上の角引用）の外観があるかもしれない。）

source: For multiline comments it is recommended (but not required) to use two or more brackets both for visual clarity and to avoid relying too much on internal bracket counting heuristics when commenting code that may accidentally miscount single brackets:
ja: 一つのブラケットを偶然に数え誤るかもしれないコードを注釈するとき、マルチラインコメントのために、それは視覚の明快さのために両方とも複数のブラケットを使って、あまりにたくさん発見的教授法を含む内部のブラケットに頼ることを避けると勧められる（しかし、必要でない）：

source: However, it's sometimes better to use Pod comments because they are implicitly line-oriented.
ja: しかし、それらが暗黙のうちに行を指向するので、ポッドコメントを使うことは、時々よりよい。

source: User-selected Brackets
ja: ユーザーを選ばれたブラケット

source: For all quoting constructs that use user-selected brackets, you can open with multiple identical bracket characters, which must be closed by the same number of closing brackets.
ja: ユーザーを選ばれたブラケットを使う構成物を引合いに出しているすべてのために、あなたは複数の同一のブラケット文字で始めることができる。そして、それは同じ数の右大括弧によって閉じられなければならない。

source: Counting of nested brackets applies only to pairs of brackets of the same length as the opening brackets:
ja: 入れ子になったブラケットのカウントは、左大括弧と同じ長さのブラケットの組だけにあてはまる：

source: Note however that bare circumfix or postcircumfix &lt;&lt;...&gt;&gt; is not a user-selected bracket, but the ASCII variant of the ≪...≫ interpolating word list.
ja: しかし、裸のcircumfixまたはpostcircumfix &lt;&lt;...&gt;&gt;がユーザーを選ばれたブラケットでなく、ワードリストを改変している≪...≫のASCII変形である点に注意しなさい。

source: Only #` and the q-style quoters (including m, s, tr, and rx) enable subsequent user-selected brackets.
ja: #`とqスタイルの引用者（m、s、trとrxを含む）だけは、以降のユーザーを選ばれたブラケットを可能にする。

source: Some languages such as C allow you to escape newline characters to combine lines.
ja: Cのようないくらかの言語は、行を結合するために改行文字をエスケープすることができる。

source: Other languages (such as regexes) allow you to backslash a space character for various reasons.
ja: 他の言語（例えば正規表現）は、賛成にいろいろな空白文字が論じるバックスラッシュに、あなたを許す。

source: Perl 6 generalizes this notion to any kind of whitespace.
ja: Perl 6は、この概念をどんな空白文字にでも一般化する。

source: Any contiguous whitespace (including comments) may be hidden from the parser by prefixing it with \.
ja: 何か隣接する空白文字（コメントを含む）は、\でそれを前に置くことによって、構文解析器から隠されるかもしれない。

source: This is known as the &quot;unspace&quot;.
ja: これは、「unspace」として知られている。

source: An unspace can suppress any of several whitespace dependencies in Perl.
ja: unspaceは、Perlでいくつかの空白文字依存のどれでも抑制することができる。

source: For example, since Perl requires an absence of whitespace between a noun and a postfix operator, using unspace lets you line up postfix operators:
ja: たとえば、Perlが名詞と後置演算子の間で空白文字の欠如を必要とする時から、unspaceを使うことはあなたに後置演算子を一列に並べさせる：

source: As a special case to support the use above, a backslash where a postfix is expected is considered a degenerate form of unspace.
ja: 上記の使用をサポートする特例として、接尾辞が予想されるバックスラッシュは、unspaceに退歩した形を考えられる。

source: Note that whitespace is not allowed before that, hence
ja: それゆえに、空白文字がそれの前に許されないことに注意すべきである

source: is a syntax error (two terms in a row).
ja: 構文エラー（列の2つの項）である。

source: And
ja: そして、

source: will be parsed as a list operator with a Capture argument:
ja: Capture引数によるリスト演算子として解析される：

source: However, other forms of unspace may usefully be preceded by whitespace.
ja: しかし、unspaceの他の形は、有効に空白文字の後にあるかもしれない。

source: (Unary uses of backslash may therefore never be followed by whitespace or they would be taken as an unspace.)
ja: （したがって、バックスラッシュを単一体の使う自由の後に空白文字が決して続かないかもしれない、または、それらはunspaceとしてとられる。）

source: Other postfix operators may also make use of unspace:
ja: 他の後置演算子は、unspaceを使用もするかもしれない：

source: Another normal use of a you-don't-see-this-space is typically to put a dotted postfix on the next line:
ja: you-don't-see-this-spaceのもう一つの通常使用は、一般的に、ドットの接尾辞を次行に置くことである：

source: But unspace is mainly about language extensibility:
ja: しかし、unspaceは主に言語拡張性についてある：

source: it lets you continue the line in any situation where a newline might confuse the parser, regardless of your currently installed parser.
ja: あなたの現在設置された構文解析器に関係なく、それはあなたに改行文字が構文解析器を混同するかもしれない何か状況で線を続けさせる。

source: (Unless, of course, you override the unspace rule itself...)
ja: （もちろん、あなたがunspaceルール自体にオーバーライドしない限り、...）

source: Although we say that the unspace hides the whitespace from the parser, it does not hide whitespace from the lexer.
ja: 我々がunspaceが空白文字を構文解析器から隠すと言うが、それは空白文字をlexerから隠さない。

source: As a result, unspace is not allowed within a token.
ja: その結果、unspaceはトークンの中で許されない。

source: Additionally, line numbers are still counted if the unspace contains one or more newlines.
ja: その上、unspaceが一つ以上の改行文字を含むならば、線番号はまだ数えられる。

source: Since Pod chunks count as whitespace to the language, they are also swallowed up by unspace.
ja: ポッド塊が言語への空白文字と見なされるので、それらはunspaceによってものみこまれる。

source: Heredoc boundaries are suppressed, however, so you can split excessively long heredoc intro lines like this:
ja: しかし、ヒアドキュメント境界線は抑制されるので、あなたはこのように極端に長いヒアドキュメントイントロ行を分割することができる：

source: To the heredoc parser that just looks like:
ja: ちょうど以下のように見えるヒアドキュメント構文解析器に：

source: Note that this is one of those cases in which it is fine to have whitespace before the unspace, since we're only trying to suppress the newline transition, not all whitespace as in the case of postfix parsing.
ja: 我々が改行文字移行（接尾辞構文解析の場合のようにすべての空白文字でない）を抑制しようとしているだけの時から、これがunspaceの前に空白文字を持つために天気がよいそれらのケースの1つである点に注意しなさい。

source: (Note also that the example above is not meant to spec how the test suite works.
ja: （また、上の例がテストスイートが機能する仕様にとって意味されない点に注意しなさい。

source: ) Comments in Unspaces and vice versa
ja: ）Unspacesで、そして、逆もまた同じコメントする

source: An unspace may contain a comment, but a comment may not contain an unspace.
ja: unspaceはコメントを含むかもしれない、しかし、コメントはunspaceを含まないかもしれない。

source: In particular, end-of-line comments do not treat backslash as significant.
ja: 特に、重要であるように、行末コメントはバックスラッシュを扱わない。

source: If you say:
ja: あなたが以下のように言うならば：

source: or
ja: または、

source: it is an end-of-line comment, not an embedded comment.
ja: それは、行末コメント（埋め込みコメントでない）である。

source: Write:
ja: 書きなさい：

source: to mean the other thing.
ja: 他のものを意味すること。

source: Optional Whitespace and Exclusions
ja: オプションの空白文字と除外

source: In general, whitespace is optional in Perl 6 except where it is needed to separate constructs that would be misconstrued as a single token or other syntactic unit.
ja: 一般に、それが単一トークンまたは他の構文単位として誤解される構成物を切り離すために必要な場合を除き、空白文字はPerl 6でオプションである。

source: (In other words, Perl 6 follows the standard longest-token principle, or in the cases of large constructs, a prefer shifting to reducing principle.
ja: （言い換えると、Perl 6は、あるいは、大きな構成概念のケースで、標準的な最も長く形だけの主義に従う。そして、主義を減らすことに変わるのを好みなさい。

source: See &quot;Grammatical Categories&quot; below for more on how a Perl program is analyzed into tokens.)
ja: Perlプログラムがトークンに分析される方法の詳細について、下記の「文法範疇」を見なさい。）

source: This is an unchanging deep rule, but the surface ramifications of it change as various operators and macros are added to or removed from the language, which we expect to happen because Perl 6 is designed to be a mutable language.
ja: これは変わらない深いルールである、しかし、いろいろな演算子とマクロが言語に加えられるか、それから取り除かれて、それの表面の結果は変わる、そしてそれは、Perl 6が変わりやすい言語であるようになっているので、我々は起こると思っている。

source: In particular, there is a natural conflict between postfix operators and infix operators, either of which may occur after a term.
ja: 特に、後置演算子と中置演算子の自然な対立がある。そして、そのいずれかが項の後起こる場合がある。

source: If a given token may be interpreted as either a postfix operator or an infix operator, the infix operator requires space before it.
ja: 所定のトークンが後置演算子かインフィックスオペレータと解釈されるならば、インフィックスオペレータはそれの前にスペースを必要とする。

source: Postfix operators may never have intervening space, though they may have an intervening dot.
ja: それらが間のドットを持っているかもしれないけれども、後置演算子は間のスペースを決して持っていないかもしれない。

source: If further separation is desired, an unspace or embedded comment may be used as described above, as long as no whitespace occurs outside the unspace or embedded comment.
ja: 更なる区切りが要求されるならば、空白文字がunspaceまたは埋め込みコメントの外で起こらない限り、unspaceまたは埋め込みコメントが先に述べたように使われるかもしれない。

source: For instance, if you were to add your own infix:&lt;++&gt; operator, then it must have space before it.
ja: たとえば、あなたがあなた自身のinfix:&lt;++&gt;演算子を加えることになっているならば、それはそれの前にスペースを持っていなければならない。

source: The normal autoincrementing postfix:&lt;++&gt; operator may never have space before it, but may be written in any of these forms:
ja: 通常のautoincrementingしているpostfix:&lt;++&gt;演算子は、それの前にスペースを決して持っていないかもしれなくて、これらの形の少しも書き込まれるかもしれない：

source: Implicit Topical Method Calls
ja: 陰の時事的なメソッドは訪問する

source: A consequence of the postfix rule is that (except when delimiting a quote or terminating an unspace) a dot with whitespace in front of it is always considered a method call on $_ where a term is expected.
ja: 接尾辞支配の結果は、それの前の空白文字による点が項が予想される$_の上のメソッド呼び出しと常に考えられるということで（引用を区切るか、unspaceを終了するとき以外は）ある。

source: If a term is not expected at this point, it is a syntax error.
ja: 項がこの点で期待されないならば、それは構文エラーである。

source: (Unless, of course, there is an infix operator of that name beginning with dot.
ja: （もちろん、それの中置演算子がない限り、ドットで始めを挙げなさい。

source: You could, for instance, define a Fortranly infix: &lt;.EQ.&gt; if the fit took you.
ja: 合うものがあなたを連れて行くならば、あなたは、たとえば、Fortranlyなinfix: &lt;.EQ.&gt;を定義することができる。

source: But you'll have to be sure to always put whitespace in front of it, or it would be interpreted as a postfix method call instead.)
ja: しかし、あなたがそれの前に常に空白文字を置くことは確実でなければならない、または、それはその代わりに接尾辞メソッド呼び出しと解釈される。）

source: For example,
ja: たとえば、

source: and
ja: そして、

source: will always be interpreted as
ja: 常に通訳される

source: but never as
ja: しかし、決してでなく、

source: Use some variant of
ja: 若干の変形を使いなさい

source: if you mean the postfix method call.
ja: あなたが接尾辞メソッドを意味するならば、電話しなさい。

source: One consequence of all this is that you may no longer write a Num as 42. with just a trailing dot.
ja: こんな1つの結果は、ちょうど後置点による42.としてNumをもはや書かなくてもよいということである。

source: You must instead say either 42 or 42.0.
ja: あなたは、42か42.0をその代わりに言わなければならない。

source: In other words, a dot following a number can only be a decimal point if the following character is a digit.
ja: 言い換えると、以下の文字が桁であるならば、数の後の点は小数点でありえるだけである。

source: Otherwise the postfix dot will be taken to be the start of some kind of method call syntax.
ja: さもなければ、接尾辞点は、何らかのメソッド呼び出し構文の始まりであるとみなされる。

source: (The .123 form with a leading dot is still allowed however when a term is expected, and is equivalent to 0.123 rather than $_.123.)
ja: （項が予想されるとき、先頭のドットによる.123の形はしかしまだ許されて、$_.123よりもむしろ0.123に等しい。）

source: Built-In Data Types
ja: 組み込みデータ型

source: Perl 6 has an optional type system that helps you write safer code that performs better.
ja: Perl 6には、あなたがよりよく機能するより安全なコードを書くのに役立つオプションの型システムがある。

source: The compiler is free to infer what type information it can from the types you supply, but it will not complain about missing type information unless you ask it to.
ja: コンパイラは何がそれがあなたが供給する型からそうすることができるという情報を入力するかについて推測することができる、しかし、あなたがそれを尋ねない限り、それはなくなった型情報について不満を言わない。

source: Perl 6 is an OO engine, but you're not generally required to think in OO when that's inconvenient.
ja: Perl 6はオブジェクト指向エンジンである、しかし、あなたはそれが不便であるオブジェクト指向で考えることを一般に要求されない。

source: However, some built-in concepts such as filehandles are more object-oriented in a user-visible way than in Perl 5.
ja: しかし、ファイルハンドルのような若干のビルトインコンセプトは、Perl 5でよりユーザー見える方法で、オブジェクト指向である。

source: The P6opaque Datatype
ja: P6opaqueデータ型

source: In support of OO encapsulation, there is a new fundamental data representation:
ja: オブジェクト指向カプセル化を支持して、新しい基本的なデータ表現がある：

source: External access to opaque objects is always through method calls, even for attributes.
ja: 属性のためにさえ、不透明オブジェクトへの外部のアクセスは、常にメソッド呼び出しを通してある。

source: Name Equivalence of Types
ja: 型の名前同値

source: Types are officially compared using name equivalence rather than structural equivalence.
ja: 型は、構造同値よりもむしろ名前同値を使って、表向きは比較される。

source: However, we're rather liberal in what we consider a name.
ja: しかし、我々は、名前を何であると考えるかについて、むしろ寛大である。

source: For example, the name includes the version and authority associated with the module defining the type (even if the type itself is &quot;anonymous&quot;).
ja: たとえば、名前はバージョンを含む、そして、権限は型（たとえ型自体が「匿名である」としても）を定義しているモジュールと結びついた。

source: Beyond that, when you instantiate a parametric type, the arguments are considered part of the &quot;long name&quot; of the resulting type, so one Array of Int is equivalent to another Array of Int.
ja: それを越えて、あなたがパラメータの型を具体例をあげて示すとき、引数は結果として生じる型の「長い名前」のよく考えた部分であるので、1つのArray of Intはもう一つのArray of Intに等しい。

source: (Another way to look at it is that the type instantiation &quot;factory&quot; is memoized.) Typename aliases are considered equivalent to the original type.
ja: Typename別名は、最初の型に等しいと考えられる（それを見るもう一つの方法は、型インスタンス化「ファクトリー」がmemoizedされるということである。）。

source: In particular, the Array of Int syntax is just sugar for Array:of(Int), which is the canonical form of an instantiated generic type.
ja: 特に、Array of Int構文はちょうどArray:of(Int)のためのシュガーである。そして、それは具体例をあげて示された汎用的な型の標準形である。

source: This name equivalence of parametric types extends only to parameters that can be considered immutable (or that at least can have an immutable snapshot taken of them).
ja: パラメータの型のこの名前同値は、不変である（または、それは不変のスナップショットをそれらの撮って少なくともおくことができる）と考えられることができるパラメータだけに及ぶ。

source: Two distinct classes are never considered equivalent even if they have the same attributes because classes are not considered immutable.
ja: クラスが不変であると考えられないのでたとえそれらには同じ属性があるとしても、2つの異なったクラスは等しいと決して考えられない。

source: Properties on Objects
ja: オブジェクトのプロパティ

source: Perl 6 supports the notion of properties on various kinds of objects.
ja: Perl 6は、いろいろなオブジェクトでプロパティの概念をサポートする。

source: Properties are like object attributes, except that they're managed by the individual object rather than by the object's class.
ja: プロパティはオブジェクト属性のようであるが、それらはオブジェクトのクラスによってよりもむしろ個々のオブジェクトによって管理される。

source: According to S12, properties are actually implemented by a kind of mixin mechanism, and such mixins are accomplished by the generation of an individual anonymous class for the object (unless an identical anonymous class already exists and can safely be shared).
ja: S12によると、プロパティは実は一種のミキシンメカニズムで実装される、そして、そのようなミキシンはオブジェクト（同一の匿名のクラスがすでに存在して、問題なく共有されることができない限り）のために個々の匿名のクラスの生成によって達成される。

source: Traits
ja: トレイト
